In [3]:
import pandas as pd
df =pd.read_csv("titanic_train.csv")

In [4]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

### 1. size of the data

In [5]:
df.shape

(891, 12)

In [6]:
3*3

9

In [7]:
891*12

10692

In [8]:
df.size

10692

In [9]:
df.memory_usage(deep=True)

Index            128
PassengerId     7128
Survived        7128
Pclass          7128
Name           74813
Sex            54979
Age             7128
SibSp           7128
Parch           7128
Ticket         56802
Fare            7128
Cabin          34344
Embarked       51626
dtype: int64

# 2. how the data looks likes

In [10]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [11]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [12]:
df.sample(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
852,853,0,3,"Boulos, Miss. Nourelain",female,9.0,1,1,2678,15.2458,NaN,C
770,771,0,3,"Lievens, Mr. Rene Aime",male,24.0,0,0,345781,9.5000,NaN,S
771,772,0,3,"Jensen, Mr. Niels Peder",male,48.0,0,0,350047,7.8542,NaN,S
671,672,0,1,"Davidson, Mr. Thornton",male,31.0,1,0,F.C. 12750,52.0000,B71,S
119,120,0,3,"Andersson, Miss. Ellis Anna Maria",female,2.0,4,2,347082,31.2750,NaN,S

# 3. what are the dtype of col

In [13]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

# 4. how data looks like mathematically

In [15]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
PassengerId,891.0,446.000000,257.353842,1.00,223.5000,446.0000,668.5,891.0000
Survived,891.0,0.383838,0.486592,0.00,0.0000,0.0000,1.0,1.0000
Pclass,891.0,2.308642,0.836071,1.00,2.0000,3.0000,3.0,3.0000
Age,714.0,29.699118,14.526497,0.42,20.1250,28.0000,38.0,80.0000
SibSp,891.0,0.523008,1.102743,0.00,0.0000,0.0000,1.0,8.0000
Parch,891.0,0.381594,0.806057,0.00,0.0000,0.0000,0.0,6.0000
Fare,891.0,32.204208,49.693429,0.00,7.9104,14.4542,31.0,512.3292

# 5. check missing value

In [16]:
df.isnull()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

In [17]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [18]:
df.isnull().sum().sum()

866

#  duplilcated value

In [19]:
df.duplicated().sum()

0

In [20]:
df[df.duplicated()]

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked]
Index: []

# check the unique value

In [21]:
df.nunique()

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

In [22]:
corr_mat=df.corr()

ValueError: could not convert string to float: 'Braund, Mr. Owen Harris'

In [ ]:
import seaborn as sns

sns.heatmap(corr_mat,annot=True)

# univaritae analysis
# bivariate analysis
# multivariate analysis

In [ ]:
df.head(50)

In [ ]:
df.columns

In [ ]:
### categoical variale
### numeric variable

In [ ]:
cat_feature=[column for column in df.columns if df[column].dtype=="O"]

In [ ]:
num_feature=[column for column in df.columns if df[column].dtype!="O"]

In [ ]:
df[cat_feature]

In [ ]:
df[num_feature]

# categorical column

# 1. count plot

In [ ]:
sns.countplot(df["Embarked"])

In [ ]:
sns.countplot(df["Sex"])

In [ ]:
sns.countplot(df["Pclass"])

In [ ]:
df["Sex"].value_counts().plot(kind='bar')

# 2. pie chart

In [ ]:
df["Sex"].value_counts().plot(kind="pie",autopct='%.2f')

In [ ]:
df["Pclass"].value_counts().plot(kind="pie",autopct='%.2f')

# numerical column

# 1. histogram

In [ ]:
import matplotlib.pyplot as plt

In [ ]:
plt.hist(df["Age"])

In [ ]:
plt.hist(df["Age"],bins=5)

In [ ]:
plt.hist(df["Age"],bins=20)

# Distplot

In [ ]:
sns.distplot(df["Age"])

# Boxplot

In [ ]:
sns.boxplot(df["Age"])

In [ ]:
df["Age"].min()

In [ ]:
df["Age"].max()

In [ ]:
df["Age"].mean()

In [ ]:
df["Age"].median()

In [ ]:
df["Age"].skew()

In [ ]:
1-0.38910778230082704

# Bivariate analysis

In [ ]:
categorical
numerical

In [ ]:
X-> categorical Y-> categorical

X-> numerical   Y-> numeircal

X-> catgorical  Y-> numerical

# Mulvariate analysis

#### here more than 2 column(3,4,5,6,7...n) will be involed

In [ ]:
tips=sns.load_dataset("tips")

In [ ]:
flight=sns.load_dataset("flights")

In [ ]:
iris=sns.load_dataset("iris")

# 1. scatter plot (X-> numeric variable y-> nummeric variable)

In [ ]:
tips

In [ ]:
sns.scatterplot(tips["total_bill"],tips["tip"],hue=tips["sex"],style=tips["smoker"])

# 2. bar plot (X-> numeric variable y-> categorical variable)

In [ ]:
sns.barplot(tatinc["Pclass"],tatinc["Age"],hue=tatinc["Sex"])

In [ ]:
tatinc.head(2)

# 2. box plot (X-> numeric variable y-> categorical variable)

In [ ]:
sns.boxplot(tatinc["Sex"],tatinc["Age"],hue=tatinc["Survived"])

In [ ]:
tatinc[tatinc["Survived"]==0]["Age"].max()

In [ ]:
tatinc[tatinc["Survived"]==0]["Age"].min()

In [ ]:
tatinc[tatinc["Survived"]==1]["Age"].max()

In [ ]:
tatinc[tatinc["Survived"]==1]["Age"].min()

In [ ]:
sns.distplot(tatinc[tatinc["Survived"]==0]["Age"],hist=False)
sns.distplot(tatinc[tatinc["Survived"]==1]["Age"],hist=False)

# heatmap plot (X-> categoricla variable y-> categorical variable)

In [ ]:
tatinc.head()

In [ ]:
tatinc["Pclass"]

In [ ]:
tatinc["Survived"]

In [ ]:
pd.crosstab(tatinc["Pclass"],tatinc["Survived"])

In [ ]:
sns.heatmap(pd.crosstab(tatinc["Pclass"],tatinc["Survived"]),annot=True)

In [ ]:
iris.head()

In [ ]:
sns.pairplot(iris,hue="species")

# Lineplot()

In [ ]:
sns.lineplot(tips["total_bill"],tips["tip"])

In [ ]:
sns.scatterplot(tips["total_bill"],tips["tip"])

In [ ]:
flight

In [ ]:
flight_new=flight.groupby("year").sum().reset_index()

In [ ]:
sns.lineplot(flight["month"],flight["passengers"])

In [ ]:
sns.lineplot(flight_new["year"],flight_new["passengers"])

In [ ]:
flight.pivot_table(values="passengers",index="month",columns="year")

In [ ]:
plt.figure(figsize=(15,15))
sns.heatmap(flight.pivot_table(values="passengers",index="month",columns="year"),annot=True)

In [ ]:
from pandas_profiling import ProfileReport

In [ ]:
profile=ProfileReport(tatinc,title="pandas profiling report")

In [ ]:
profile.to_file("your_report.html")

In [ ]:
sns.clustermap(flight.pivot_table(values="passengers",index="month",columns="year"),annot=True)